<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Matrix Homeserver URL
    |--------------------------------------------------------------------------
    */
    'homeserver_url' => env('MATRIX_HOMESERVER_URL', 'http://localhost:8008'),
    'media_store_path' => env('MATRIX_MEDIA_STORE_PATH', '/home/maksim/synapse/media_store'),

    /*
    |--------------------------------------------------------------------------
    | Admin Access Token
    |--------------------------------------------------------------------------
    */
    'admin_access_token' => env('MATRIX_ADMIN_ACCESS_TOKEN'),

    /*
    |--------------------------------------------------------------------------
    | TTL для txnId (в секундах)
    |--------------------------------------------------------------------------
    */
    'txn_id_ttl' => env('MATRIX_TXN_ID_TTL', 300), // 5 минут
];